# Question 1
Consider the following Python module:
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2
After importing the module into the interpreter, you execute:

b()

b()

b()

a

?

What value is displayed when the last expression (a) is evaluated? Explain your answer by indicating what happens in every executed statement.

In [111]:
a = 0            #a is assigned 0  
def b():         #defining function b
 global a      #declaring a as global variable for values in function b
 a = c(a)      
def c(a):          # defining c funtion and 
 return a + 2          # adding 2 to a

In [112]:
b()      #after calling the function b first time the a is assigned as value 2

In [108]:
b()        #again after calling the funtion b, the a is added with 2 i.e., a + 2 = 2+2 = 4

In [109]:
b()    #again the same loop repeats and when function b is called the new value of a is a + 2 = 4+2 = 6

In [110]:
a        #when we called funtion a the latest value contained in a i.e., 6 will be printed as output

6

## Question 2

Function fileLength(), given to you, takes the name of a file as input and returns the length of the file:

fileLength('midterm.py')
284

fileLength('idterm.py')
Traceback (most recent call last):
File "<pyshell#34>", line 1, in <module>
 fileLength('idterm.py')
File "/Users/me/midterm.py", line 3, in fileLength
 infile = open(filename)
FileNotFoundError: [Errno 2] No such file or directory:
'idterm.py'

As shown above, if the file cannot be found by the interpreter or if it cannot be read as a text file, an exception will be raised. Modify function fileLength() so that a friendly message is printed instead:

fileLength('midterm.py')
358

fileLength('idterm.py')
File idterm.py not found.

In [113]:

def fileLength(file):
    
    try:                          # looks for the file and returns the length if found
        inputfile = open(file)          #opening file
        readfile = inputfile.read()         #reading the file
        inputfile.close()                #closing the ile
        return len(readfile)
    
    except:                       # if file doesnt exist then it will print the error stating "file can not be found"
        print('File {} not found.'.format(file))

In [114]:
fileLength('File.ipynb')

File File.ipynb not found.

In [115]:
fileLength('Fil.ipynb')

File Fil.ipynb not found.

## question 3
Write a class named Marsupial that can be used as shown below:

m = Marsupial() 
m.put_in_pouch('doll')
m.put_in_pouch('firetruck') 
m.put_in_pouch('kitten') 
m.pouch_contents()

['doll', 'firetruck', 'kitten']

Now write a class named Kangaroo as a subclass of Marsupial that inherits all the attributes of Marsupial and also:
a. extends the Marsupial __init__ constructor to take, as input, the coordinates x and y of the Kangaroo object,
b. supports method jump that takes number values dx and dy as input and moves the kangaroo by dx units along the x-axis and by dy units along the yaxis, and
c. overloads the __str__ operator so it behaves as shown below.

k = Kangaroo(0,0)
print(k)

I am a Kangaroo located at coordinates (0,0)

k.put_in_pouch('doll')

k.put_in_pouch('firetruck')

k.put_in_pouch('kitten')

k.pouch_contents()

['doll', 'firetruck', 'kitten']

k.jump(1,0)

k.jump(1,0)

k.jump(1,0)

print(k)

I am a Kangaroo located at coordinates (3,0)

In [116]:
class Marsupial:                        #Marsupial parent class
    
    def __init__(self,x,y):             #defining constructor to take input x and y variables of parent class
        self.pouch=[]                   #creating empty list
        
        
    def put_in_pouch(self,items):        #items appended to the empty self.pouch() list
        self.pouch.append(items)
        
    def pouch_contents(self):           #defining and displaying all the items added in self.pouch() list
        return self.pouch

class Kangaroo(Marsupial):              #creating sub-class Kangaroo of parent class
    def __init__(self,x,y):              
        super().__init__(x,y)          #extending Marsupial constructor to take coordinates x and y both 
        self.dx = 0                      
        self.dy = 0                       #setting x and y coordinates 
    
    def jump(self,x,y):                 
        self.dx = self.dx + x               #defining jump function to jump the coordinates of Kangaroo as per input 
        self.dy = self.dy + y
    
    def __str__(self):                                                        #overload the _str_ operator 
        
        return ('I am a Kangaroo located at coordinates({},{})'.format(self.dx,self.dy))

In [117]:
k = Kangaroo(0,0)
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()
print("contents in the list are")
print(k.pouch)                        #printing the content in the pouch list

contents in the list are
['doll', 'firetruck', 'kitten']

In [118]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates(3,0)

# question 4

Implement a new GUI class App that combines user-defined tkinter widget classes Calculator and Mortgage displayed below: 
(This question can be done using a .py file)

Attached the question 4 .py file and output in the separate doc.

# Question 5 
Write function collatz() that takes a positive integer x as input and prints the Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying this rule to the previous number x in the sequence:

x =   { 洧논/2 洧녰洧녭 洧논 洧녰洧 洧뉧롐洧뉧롐;

     3洧논 + 1 洧녰洧녭 洧논 洧녰洧 洧녶洧녬d
      

Your function should stop when the sequence gets to number 1. Your implementation must be recursive, without any loops.

collatz(1)
1

collatz(10)
10

5

16

8

4

2

1

In [128]:
def collatz(number):
    
    print('collatz sequence of {} is '.format(number))
    print(number)
    
    while number!= 1:
        
        if number%2 == 0:
            number = number//2
            print(number)
            
        else:
                number = (3*number) + 1
                print(number)
                
collatz(1)
collatz(10)

collatz sequence of 1 is
1
collatz sequence of 10 is
10
5
16
8
4
2
1

## question 6
Write a recursive method binary() that takes a non-negative integer n and prints the binary representation of integer n.

binary(0) = 0

binary(1) = 1

binary(3) = 11

binary(9) = 1001

In [119]:

def binary(integer):         #defining binary method which takes non-negative integet
    
    print("Binary representation of {} is".format(integer))
    
    if(integer >= 0):                            #if integer is 0 or more then print integer in binary form
        print(format(integer,"b"))          
    
    else:
        return 'number is negative or 0'                 #else print that the number is negative or zero.
    

binary(0)
binary(1)
binary(3)
binary(9)

Binary representation of 0 is
0
Binary representation of 1 is
1
Binary representation of 3 is
11
Binary representation of 9 is
1001

## question 7
Implement a class named HeadingParser that can be used to parse an HTML document, and retrieve and print all the headings in the document. You should implement your class as a subclass of HTMLParser, defined in Standard Library module html.parser. When fed a string containing HTML code, your class should print the headings, one per line and in the order in which they appear in the document. Each heading should be indented as follows: an h1 heading should have indentation 0, and h2 heading should have indentation 1, etc. Test your implementation using w3c.html.

infile = open('w3c.html')

content = infile.read()

infile.close()

hp = HeadingParser()

hp.feed(content)

W3C Mission

Principles

In [120]:
from html.parser import HTMLParser            #defining library module html.parser and importing library

f = open(r'C:\Users\16479\Desktop\w3c.html')            #opening and reading the html file
a=str(f.read())

class HeadingParser(HTMLParser):         #defining HeadingParser class as subclass of HTMLParser
  
    def __init__(self):                    #object instance
        HTMLParser.__init__(self)
        self.flag = 0 
    
    def handle_starttag(self, tag, attrs):                     #defining start function
        
        if tag == 'h1' or tag == 'h2' or tag == 'h3' or tag == 'h4' or tag=='h5' or tag == 'h6' or tag == 'h7':
            self.flag += 1                                     #checking html file tags for headings and setting flag to 1
        else:
            self.flag = 0
            
    def handle_data(self, data):            #defining function to print the heading of html
        if self.flag and data!='\n':
            
            print('{} {} '.format(self.flag*' ', data))


parser = HeadingParser()                            #calling the class HeadingParser
parser.feed(a)

  W3C Mission
  Principles

## question 9
Write SQL queries on the below database table that return:

a) All the temperature data.

b) All the cities, but without repetition.

c) All the records for India.

d) All the Fall records.

e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

g) The total annual rainfall for Cairo.

h) The total rainfall for each season.

|City  | Country       | Season | Temperature (C) | Rainfall (mm) |
|----- |---------------|--------|-----------------|---------------|
|Mumbai|India          |Winter  |24.8             |5.9            |          
|Mumbai|India          |Spring  |28.4             |16.2           |
|Mumbai|India          |Summer  |27.9             |1549.4         |
|Mumbai|India          |Fall    |27.6             |346.0          |
|London|United Kingdom |Winter  |4.2              |207.7          |
|London|United Kingdom |Spring  |8.3              |169.6          |
|London|United Kingdom |Summer  |15.7             |157.0          |
|London|United Kingdom | Fall   |10.4             |218.5          |
|Cairo |Egypt          |Winter  |13.6             |16.5           |
|Cairo |Egypt          |Spring  |20.7             |6.5            |
|Cairo |Egypt          |Summer  |27.7             |0.1            |
|Cairo |Egypt          |Fall    |22.2             |4.5            |

In [122]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [123]:
%sql sqlite://

In [77]:
%%sql
CREATE TABLE record(City varchar(50), Country varchar(50), Season varchar(50), Temperature int, Rainfall int);
INSERT INTO record VALUES('Mumbai', 'India', 'Winter', '24.8', '5.9');
INSERT INTO record VALUES('Mumbai', 'India', 'Spring', '28.4', '16.2');
INSERT INTO record VALUES('Mumbai', 'India', 'Summer', '27.9', '1549.4');
INSERT INTO record VALUES('Mumbai', 'India', 'Fall', '27.6', '346.0');
INSERT INTO record VALUES('London', 'United Kingdon', 'Winter', '4.2', '207.7');
INSERT INTO record VALUES('London', 'United Kingdon', 'Spring', '8.3', '169.6');
INSERT INTO record VALUES('London', 'United Kingdon', 'Summer', '15.7', '157.0');
INSERT INTO record VALUES('London', 'United Kingdon', 'Fall', '10.4', '218.5');
INSERT INTO record VALUES('Cairo', 'Egypt', 'Winter', '13.6', '16.5');
INSERT INTO record VALUES('Cairo', 'Egypt', 'Spring', '20.7', '6.5');
INSERT INTO record VALUES('Cairo', 'Egypt', 'Summer', '27.7', '0.1');
INSERT INTO record VALUES('Cairo', 'Egypt', 'Fall', '22.2', '4.5');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [78]:
%sql SELECT * FROM record;        #displaying table created

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdon', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdon', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdon', 'Summer', 15.7, 157),
 ('London', 'United Kingdon', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [124]:
#a part - All the temperature data.

%sql SELECT Temperature FROM record;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [83]:
#b part - All the cities, but without repetition.

%sql SELECT DISTINCT City FROM record;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [87]:
#c part - All the records for India.

%sql SELECT * FROM record WHERE Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346)]

In [88]:
#d part - All the Fall records.

%sql SELECT * FROM record WHERE Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdon', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [89]:
#e part - The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

%sql SELECT City, Country, Season FROM record WHERE Rainfall BETWEEN 200 And 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdon', 'Winter'),
 ('London', 'United Kingdon', 'Fall')]

In [92]:
#f part - The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

%sql SELECT City, Country FROM record WHERE Season = 'Fall' AND Temperature >20 ORDER BY Temperature ASC;

 * sqlite://
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

In [93]:
#g part - The total annual rainfall for Cairo.

%sql SELECT Sum(Rainfall) FROM record WHERE City='Cairo';

 * sqlite://
Done.

[(27.6,)]

In [94]:
#h part - The total rainfall for each season.
%sql SELECT Season, Sum(Rainfall) FROM record GROUP BY Season;

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

## question 10

Suppose list words is defined as follows:

words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

Write list comprehension expressions that use list words and generate the following lists:

a) in Upper case letters

b) in lower case letters

c) the list of lengths of words in list words

d) the list containing a list for every word of list words, where each list contains the word in uppercase and lowercase and the length of the word

e) the list of words in list words containing 4 or more characters.

In [97]:
list = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

#a part -  in Upper case letters

UpperList = [word.upper() for word in list]
print(UpperList)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [100]:
#b part - in lower case letters

LowerList = [word.lower() for word in list]
print(LowerList)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [102]:
#c part - the list of lengths of words in list words

LengthList = [ len(word) for word in list]
print(LengthList)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [103]:
#d part - the list containing a list for every word of list words, where each list contains the word 
# in uppercase and lowercase and the length of the word

LIST = [ [word.upper(), word.lower(), len(word)] for word in list]
print(LIST)

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

In [125]:
#e part -  the list of words in list words containing 4 or more characters

list4words = [word for word in list if len(word)>= 4]
print(list4words)

['quick', 'brown', 'jumps', 'over', 'lazy']